testrecords/update/REQ_094306427.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header/><soap:Body><ucp:updateRequest xmlns:srw="http://www.loc.gov/zing/srw/" xmlns:ucp="http://www.loc.gov/zing/srw/update/"><srw:version>1.0</srw:version><ucp:action>info:srw/action/1/replace</ucp:action><ucp:recordIdentifier>094306427</ucp:recordIdentifier><srw:record><srw:recordPacking>xml</srw:recordPacking><srw:recordSchema>info:srw/schema/1/marcxml-v1.1</srw:recordSchema><srw:recordData><mx:record xmlns:mx="http://www.loc.gov/MARC21/slim"><mx:leader>     cam a22     1i 4500</mx:leader><mx:controlfield tag="001">094306427</mx:controlfield><mx:controlfield tag="003">Sz</mx:controlfield><mx:controlfield tag="005">20140211063805.0</mx:controlfield><mx:controlfield tag="008">940908s1984    fi            00    fin d</mx:controlfield><mx:datafield ind1=" " ind2=" " tag="020"><mx:subfield code="a">951-0-06432-7 (Geb) : FM 86.-.</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="035"><mx:subfield code="a">(SNL)vtls000295852</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="035"><mx:subfield code="a">(Sz)000295852</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="040"><mx:subfield code="a">Sz</mx:subfield><mx:subfield code="c">SAZ</mx:subfield></mx:datafield><mx:datafield ind1="1" ind2=" " tag="041"><mx:subfield code="a">fin</mx:subfield><mx:subfield code="h">ger</mx:subfield></mx:datafield><mx:datafield ind1="1" ind2=" " tag="100"><mx:subfield code="a">Hesse</mx:subfield><mx:subfield code="D">Hermann</mx:subfield><mx:subfield code="9">140051996</mx:subfield><mx:subfield code="8">Hesse, Hermann</mx:subfield><mx:subfield code="8">AT: Hesse, Herman</mx:subfield><mx:subfield code="8">AT: Gesse, German</mx:subfield><mx:subfield code="8">AT: Hese, Herman</mx:subfield><mx:subfield code="8">AT: Hesė, Hermanas</mx:subfield><mx:subfield code="8">AT: Chese, Cherman</mx:subfield><mx:subfield code="8">AT: Esse, Erman</mx:subfield><mx:subfield code="8">AT: Esse, Cherman</mx:subfield><mx:subfield code="8">AT: Chesse, Cherman</mx:subfield><mx:subfield code="8">AT: Hese, Hermanam</mx:subfield><mx:subfield code="8">AT: Hese, Hermanis</mx:subfield><mx:subfield code="8">AT: Sinclair, Emil</mx:subfield><mx:subfield code="8">AT: Hesse, Herŭman</mx:subfield><mx:subfield code="8">AT: Hese, Heruman</mx:subfield><mx:subfield code="8">PS: Hermann Hesse (auch bekannt unter dem Pseud. Emil Sinclair)</mx:subfield></mx:datafield><mx:datafield ind1="1" ind2="0" tag="245"><mx:subfield code="a">Arosusi</mx:subfield><mx:subfield code="c">Hermann Hesse ; [suomentanut: Eeva-Liisa Manner]</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="260"><mx:subfield code="a">Porvoo [etc.]</mx:subfield><mx:subfield code="b">W. Söderström</mx:subfield><mx:subfield code="c">1984</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="300"><mx:subfield code="a">248 S</mx:subfield><mx:subfield code="c">22 cm</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="534"><mx:subfield code="p">Übers. von</mx:subfield><mx:subfield code="t">Der Steppenwolf</mx:subfield></mx:datafield><mx:datafield ind1="1" ind2=" " tag="700"><mx:subfield code="a">Manner</mx:subfield><mx:subfield code="D">Eeva-Liisa</mx:subfield></mx:datafield><mx:datafield ind1="1" ind2=" " tag="700"><mx:subfield code="a">Hesse</mx:subfield><mx:subfield code="D">Hermann</mx:subfield><mx:subfield code="t">Der Steppenwolf</mx:subfield><mx:subfield code="l">(finnisch)</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="898"><mx:subfield code="a">BK040000000</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="949"><mx:subfield code="B">SNL</mx:subfield><mx:subfield code="E">vtls000295852</mx:subfield><mx:subfield code="b">10010</mx:subfield><mx:subfield code="j">N 176938</mx:subfield><mx:subfield code="4">100</mx:subfield><mx:subfield code="p">1900248370</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="986"><mx:subfield code="a">SWISSBIB</mx:subfield><mx:subfield code="b">09417430X</mx:subfield></mx:datafield></mx:record></srw:recordData></srw:record></ucp:updateRequest></soap:Body></soap:Envelope>