testrecords/delete/REQ_038434628.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header/><soap:Body><ucp:updateRequest xmlns:srw="http://www.loc.gov/zing/srw/" xmlns:ucp="http://www.loc.gov/zing/srw/update/"><srw:version>1.0</srw:version><ucp:action>info:srw/action/1/delete</ucp:action><ucp:recordIdentifier>038434628</ucp:recordIdentifier><srw:record><srw:recordPacking>xml</srw:recordPacking><srw:recordSchema>info:srw/schema/1/marcxml-v1.1</srw:recordSchema><srw:recordData><mx:record xmlns:mx="http://www.loc.gov/MARC21/slim"><mx:leader>     dam a22     5u 4500</mx:leader><mx:controlfield tag="001">038434628</mx:controlfield><mx:controlfield tag="005">20131205074124.0</mx:controlfield><mx:controlfield tag="008">070605s1988    au            00    ger  </mx:controlfield><mx:datafield ind1=" " ind2=" " tag="035"><mx:subfield code="a">(OCoLC)601425640</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="040"><mx:subfield code="a">SzZuIDS BS/BE B565</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="072"><mx:subfield code="a">-</mx:subfield></mx:datafield><mx:datafield ind1="0" ind2="0" tag="245"><mx:subfield code="a">Symposion Krastal</mx:subfield><mx:subfield code="b">Steine, Bilder, Objekte, Photos : Wien, Wiener Secession, 8.9. - 10.10.1988</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="260"><mx:subfield code="a">Wien</mx:subfield><mx:subfield code="b">Wiener Secession</mx:subfield><mx:subfield code="c">1988</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="300"><mx:subfield code="a">86 S</mx:subfield><mx:subfield code="b">Portr., Taf</mx:subfield><mx:subfield code="c">24 cm</mx:subfield></mx:datafield><mx:datafield ind1=" " ind2=" " tag="898"><mx:subfield code="a">BK040000000</mx:subfield></mx:datafield></mx:record></srw:recordData></srw:record></ucp:updateRequest></soap:Body></soap:Envelope>